# BuiltInFailures.SplitToposolidFailures Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..SplitToposolidFailures Members
BuiltInFailures..::..SplitToposolidFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..SplitToposolidFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GenerateNewSplitTopoFailed | Failed to generate new toposolid after split. |
| SplitToposolidFailed | Split toposolid failed. |

# See Also
BuiltInFailures..::..SplitToposolidFailures Class
Autodesk.Revit.DB Namespace